snlkuharlocal/src/Catalogs/НастройкиДоступа/НастройкиДоступа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиДоступа</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Тип</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>УсловияОбъекта</name>
    <attributes>
      <name>ТипУзла</name>
      <type>
        <types>EnumRef.ТипУзлаИБ</types>
      </type>
    </attributes>
    <attributes>
      <name>ДляНовых</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтрокаОтбора</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеОтбора</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Приоритет</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИД_Строки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроизвольноеУсловие</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПраваДоступа</name>
    <attributes>
      <name>ИД_СтрокиРеквизитов</name>
      <comment>ИД строки реквизитов</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИД_СтрокиУсловий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Роль</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Полномочие</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПолномочияПользователей</types>
      </type>
    </attributes>
    <attributes>
      <name>Доступность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Видимость</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Редактирование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗагрузкаПриОбмене</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеИзменятьСоставСтрок</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВозможныеЗначения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Реквизиты</name>
    <attributes>
      <name>ИД_Строки</name>
      <comment>ИД строки</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПорядокРаздела</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипРаздела</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРаздела</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/Catalogs/НастройкиДоступа/ObjectModule.bsl
Процедура НастроитьПостроитель(ВыбПостроитель,СтрокаОтбора="") Экспорт
	Если ПустаяСтрока(Тип) ИЛИ ПустаяСтрока(Вид) Тогда Возврат КонецЕсли; 
	
	ВыбПостроитель.Текст="
	|ВЫБРАТЬ
	|	*
	|ИЗ "+Тип+"."+Вид+"
	|ГДЕ Ссылка=&Ссылка
	|{ГДЕ Ссылка.*}";
	
	ВыбПостроитель.ЗаполнитьНастройки();	
	
	Если НЕ ПустаяСтрока(СтрокаОтбора) Тогда
		Настройки=ЗначениеИзСтрокиВнутр(СтрокаОтбора);
		
		ВыбПостроитель.УстановитьНастройки(Настройки,Истина,Ложь,Ложь,Ложь,Ложь);
		
		Отбор=ВыбПостроитель.Отбор;
		Для Каждого ЭлементОтбора Из Отбор Цикл
			Если ЭлементОтбора.Использование И ЭлементОтбора.Значение="###" Тогда
				Если Найти(ЭлементОтбора.ПутьКДанным,"КодФизическогоУзла")<>0 Тогда
					ЭлементОтбора.Значение=ПараметрыСеанса.ЭтотУзел.Код;			
				КонецЕсли;			
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
